# GroupBy

In [1]:
import numpy as np
import pandas as pd


df = pd.DataFrame({
    'Company':['Apple','Apple','Google','Google','Meta','Meta'],
    'Emp':['Mohit','Ganeshan','Vanessa','Sara','Vikram','Pragyan'],
    'Sales':[100,120,210,187,342,290]
})
df

  Company       Emp  Sales
0   Apple     Mohit    100
1   Apple  Ganeshan    120
2  Google   Vanessa    210
3  Google      Sara    187
4    Meta    Vikram    342
5    Meta   Pragyan    290

In [13]:
by_company = df.groupby('Company')

In [5]:
by_company.mean()

C:\Users\shrey\AppData\Local\Temp\ipykernel_15408\2992551274.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_company.mean()

         Sales
Company
Apple    110.0
Google   198.5
Meta     316.0

In [6]:
by_company.max()

             Emp  Sales
Company
Apple      Mohit    120
Google   Vanessa    210
Meta      Vikram    342

In [8]:
by_company.sum(numeric_only=True)

         Sales
Company
Apple      220
Google     397
Meta       632

In [9]:
by_company.std()

C:\Users\shrey\AppData\Local\Temp\ipykernel_15408\1358006188.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_company.std()

             Sales
Company
Apple    14.142136
Google   16.263456
Meta     36.769553

In [10]:
by_company.describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
Apple     2.0  110.0  14.142136  100.0  105.00  110.0  115.00  120.0
Google    2.0  198.5  16.263456  187.0  192.75  198.5  204.25  210.0
Meta      2.0  316.0  36.769553  290.0  303.00  316.0  329.00  342.0

In [11]:
by_company.describe().transpose()

Company           Apple      Google        Meta
Sales count    2.000000    2.000000    2.000000
      mean   110.000000  198.500000  316.000000
      std     14.142136   16.263456   36.769553
      min    100.000000  187.000000  290.000000
      25%    105.000000  192.750000  303.000000
      50%    110.000000  198.500000  316.000000
      75%    115.000000  204.250000  329.000000
      max    120.000000  210.000000  342.000000

In [12]:
by_company.describe().transpose()['Meta']

Sales  count      2.000000
       mean     316.000000
       std       36.769553
       min      290.000000
       25%      303.000000
       50%      316.000000
       75%      329.000000
       max      342.000000
Name: Meta, dtype: float64